RT-Thread/rt-thread/bsp/nuvoton/libraries/nuc980/rtt_port/drv_usbd.c
/**************************************************************************//**
*
* @copyright (C) 2020 Nuvoton Technology Corp. All rights reserved.
*
* SPDX-License-Identifier: Apache-2.0
*
* Change Logs:
* Date            Author           Notes
* 2020-12-25      Wayne            First version
*
******************************************************************************/


#include <rtconfig.h>

#if defined(BSP_USING_USBD)

#include <rtthread.h>
#include <rtdevice.h>
#include <string.h>
#include "NuMicro.h"
#include <nu_bitutil.h>
#include "drv_sys.h"

#define LOG_TAG         "drv.usbd"
#define DBG_ENABLE
#define DBG_SECTION_NAME "drv.usbd"
#define DBG_LEVEL DBG_INFO
#define DBG_COLOR
#include <rtdbg.h>

/* Private define ---------------------------------------------------------------*/
#define ENABLE_FULL_SPEED_MODE_ONLY 0 /* 0: default hi-speed mode; 1: full-speed mode only */

/* Define EP maximum packet size */

#define CEP_MAX_PKT_SIZE        64
#define CEP_OTHER_MAX_PKT_SIZE  64

#define EPA_MAX_PKT_SIZE        512
#define EPA_OTHER_MAX_PKT_SIZE  64

#define EPB_MAX_PKT_SIZE        512
#define EPB_OTHER_MAX_PKT_SIZE  64

#define EPC_MAX_PKT_SIZE        64
#define EPC_OTHER_MAX_PKT_SIZE  64

#define EPD_MAX_PKT_SIZE        64
#define EPD_OTHER_MAX_PKT_SIZE  64

#define EPE_MAX_PKT_SIZE        512
#define EPE_OTHER_MAX_PKT_SIZE  64

#define EPF_MAX_PKT_SIZE        512
#define EPF_OTHER_MAX_PKT_SIZE  64

#define EPG_MAX_PKT_SIZE        64
#define EPG_OTHER_MAX_PKT_SIZE  64

#define EPH_MAX_PKT_SIZE        64
#define EPH_OTHER_MAX_PKT_SIZE  64

#define EPI_MAX_PKT_SIZE        512
#define EPI_OTHER_MAX_PKT_SIZE  64

#define EPJ_MAX_PKT_SIZE        512
#define EPJ_OTHER_MAX_PKT_SIZE  64

#define EPK_MAX_PKT_SIZE        64
#define EPK_OTHER_MAX_PKT_SIZE  64

#define EPL_MAX_PKT_SIZE        64
#define EPL_OTHER_MAX_PKT_SIZE  64

#define CEP_BUF_BASE    0
#define CEP_BUF_LEN     CEP_MAX_PKT_SIZE

#define EPA_BUF_BASE    (CEP_BUF_BASE + CEP_BUF_LEN)
#define EPA_BUF_LEN     EPA_MAX_PKT_SIZE

#define EPB_BUF_BASE    (EPA_BUF_BASE + EPA_BUF_LEN)
#define EPB_BUF_LEN     EPB_MAX_PKT_SIZE

#define EPC_BUF_BASE    (EPB_BUF_BASE + EPB_BUF_LEN)
#define EPC_BUF_LEN     EPC_MAX_PKT_SIZE

#define EPD_BUF_BASE    (EPC_BUF_BASE + EPC_BUF_LEN)
#define EPD_BUF_LEN     EPD_MAX_PKT_SIZE

#define EPE_BUF_BASE    (EPD_BUF_BASE + EPD_BUF_LEN)
#define EPE_BUF_LEN     EPE_MAX_PKT_SIZE

#define EPF_BUF_BASE    (EPE_BUF_BASE + EPE_BUF_LEN)
#define EPF_BUF_LEN     EPF_MAX_PKT_SIZE

#define EPG_BUF_BASE    (EPF_BUF_BASE + EPF_BUF_LEN)
#define EPG_BUF_LEN     EPG_MAX_PKT_SIZE

#define EPH_BUF_BASE    (EPG_BUF_BASE + EPG_BUF_LEN)
#define EPH_BUF_LEN     EPH_MAX_PKT_SIZE

#define EPI_BUF_BASE    (EPH_BUF_BASE + EPH_BUF_LEN)
#define EPI_BUF_LEN     EPI_MAX_PKT_SIZE

#define EPJ_BUF_BASE    (EPI_BUF_BASE + EPI_BUF_LEN)
#define EPJ_BUF_LEN     EPJ_MAX_PKT_SIZE

#define EPK_BUF_BASE    (EPJ_BUF_BASE + EPJ_BUF_LEN)
#define EPK_BUF_LEN     EPK_MAX_PKT_SIZE

#define EPL_BUF_BASE    (EPK_BUF_BASE + EPK_BUF_LEN)
#define EPL_BUF_LEN     EPL_MAX_PKT_SIZE


#define EPADR_SW2HW(address) ((address & USB_EPNO_MASK) - 1) /* for non-control endpoint */
#define EPADR_HW2SW(address) ((address & USB_EPNO_MASK) + 1) /* for non-control endpoint */

/* Private typedef --------------------------------------------------------------*/
typedef struct _nu_usbd_t
{
    USBD_T *base;     /* REG base */
    char *name;
    IRQn_Type irqn;
    E_SYS_IPRST rstidx;
    E_SYS_IPCLK clkidx;
    uint8_t address_tmp;    /* Keep assigned address for flow control */
} nu_usbd_t;


typedef struct
{

    uint32_t u32BufferBase;
    uint32_t u32BufferLength;

    uint32_t u32OtherMaxPktSize;

} S_EP_CXT;


/* Private variables ------------------------------------------------------------*/

static nu_usbd_t nu_usbd =
{
    .base        = USBD,
    .name        = "usbd",
    .irqn        = IRQ_UDC,
    .rstidx      = USBDRST,
    .clkidx      = USBDCKEN,
    .address_tmp = 0,
};

static struct udcd _rt_obj_udc;

static S_EP_CXT _ep_cxt_pool[] =
{
    { EPA_BUF_BASE, EPA_BUF_LEN, EPA_OTHER_MAX_PKT_SIZE}, //EPA
    { EPB_BUF_BASE, EPB_BUF_LEN, EPB_OTHER_MAX_PKT_SIZE}, //EPB
    { EPC_BUF_BASE, EPC_BUF_LEN, EPC_OTHER_MAX_PKT_SIZE}, //EPC
    { EPD_BUF_BASE, EPD_BUF_LEN, EPD_OTHER_MAX_PKT_SIZE}, //EPD
    { EPE_BUF_BASE, EPE_BUF_LEN, EPE_OTHER_MAX_PKT_SIZE}, //EPE
    { EPF_BUF_BASE, EPF_BUF_LEN, EPF_OTHER_MAX_PKT_SIZE}, //EPF
    { EPG_BUF_BASE, EPG_BUF_LEN, EPG_OTHER_MAX_PKT_SIZE}, //EPG
    { EPH_BUF_BASE, EPH_BUF_LEN, EPH_OTHER_MAX_PKT_SIZE}, //EPH
    { EPI_BUF_BASE, EPI_BUF_LEN, EPI_OTHER_MAX_PKT_SIZE}, //EPI
    { EPJ_BUF_BASE, EPJ_BUF_LEN, EPJ_OTHER_MAX_PKT_SIZE}, //EPJ
    { EPK_BUF_BASE, EPK_BUF_LEN, EPK_OTHER_MAX_PKT_SIZE}, //EPK
    { EPL_BUF_BASE, EPL_BUF_LEN, EPL_OTHER_MAX_PKT_SIZE}  //EPL
};

static struct ep_id _ep_pool[] =
{
    {0x0,               USB_EP_ATTR_CONTROL,     USB_DIR_INOUT, CEP_MAX_PKT_SIZE,    ID_ASSIGNED  },

    {EPADR_HW2SW(EPA),  USB_EP_ATTR_BULK,        USB_DIR_IN,    EPA_MAX_PKT_SIZE,    ID_UNASSIGNED},
    {EPADR_HW2SW(EPB),  USB_EP_ATTR_BULK,        USB_DIR_OUT,   EPB_MAX_PKT_SIZE,    ID_UNASSIGNED},
    {EPADR_HW2SW(EPC),  USB_EP_ATTR_INT,         USB_DIR_IN,    EPC_MAX_PKT_SIZE,    ID_UNASSIGNED},
    {EPADR_HW2SW(EPD),  USB_EP_ATTR_INT,         USB_DIR_OUT,   EPD_MAX_PKT_SIZE,    ID_UNASSIGNED},
    {EPADR_HW2SW(EPE),  USB_EP_ATTR_BULK,        USB_DIR_IN,    EPE_MAX_PKT_SIZE,    ID_UNASSIGNED},
    {EPADR_HW2SW(EPF),  USB_EP_ATTR_BULK,        USB_DIR_OUT,   EPF_MAX_PKT_SIZE,    ID_UNASSIGNED},
    {EPADR_HW2SW(EPG),  USB_EP_ATTR_INT,         USB_DIR_IN,    EPG_MAX_PKT_SIZE,    ID_UNASSIGNED},
    {EPADR_HW2SW(EPH),  USB_EP_ATTR_INT,         USB_DIR_OUT,   EPH_MAX_PKT_SIZE,    ID_UNASSIGNED},
    {EPADR_HW2SW(EPI),  USB_EP_ATTR_BULK,        USB_DIR_IN,    EPE_MAX_PKT_SIZE,    ID_UNASSIGNED},
    {EPADR_HW2SW(EPJ),  USB_EP_ATTR_BULK,        USB_DIR_OUT,   EPF_MAX_PKT_SIZE,    ID_UNASSIGNED},
    {EPADR_HW2SW(EPK),  USB_EP_ATTR_INT,         USB_DIR_IN,    EPG_MAX_PKT_SIZE,    ID_UNASSIGNED},
    {EPADR_HW2SW(EPL),  USB_EP_ATTR_INT,         USB_DIR_OUT,   EPH_MAX_PKT_SIZE,    ID_UNASSIGNED},

    {0xFF,              USB_EP_ATTR_TYPE_MASK,   USB_DIR_MASK,  0,                   ID_ASSIGNED  },
};


static void _nu_ep_partition_set(int isHighSpeed)
{
    int i;

    for (i = 0; i < USBD_MAX_EP; i++)
    {
        uint32_t u32NuEPTypeDef = 0x0;
        uint32_t u32NuEPDirDef = 0x0;

