RT-Thread/rt-thread/bsp/nuvoton/libraries/nuc980/rtt_port/drv_usbd.c
        if (_ep_pool[i + 1].type == USB_EP_ATTR_BULK)
            u32NuEPTypeDef =  USB_EP_CFG_TYPE_BULK;
        else if (_ep_pool[i + 1].type == USB_EP_ATTR_INT)
            u32NuEPTypeDef =  USB_EP_CFG_TYPE_INT;
        else
            continue;

        if (_ep_pool[i + 1].dir == USB_DIR_IN)
            u32NuEPDirDef =  USB_EP_CFG_DIR_IN;
        else if (_ep_pool[i + 1].dir == USB_DIR_OUT)
            u32NuEPDirDef =  USB_EP_CFG_DIR_OUT;
        else
            continue;

        USBD_SetEpBufAddr(i, _ep_cxt_pool[i].u32BufferBase, _ep_cxt_pool[i].u32BufferLength);
        if (isHighSpeed)
            USBD_SET_MAX_PAYLOAD(i, _ep_cxt_pool[i].u32BufferLength);
        else
            USBD_SET_MAX_PAYLOAD(i, _ep_cxt_pool[i].u32OtherMaxPktSize);

        USBD_ConfigEp(i, EPADR_HW2SW(i), u32NuEPTypeDef, u32NuEPDirDef);

        if (u32NuEPDirDef ==  USB_EP_CFG_DIR_OUT)
            USBD_ENABLE_EP_INT(i, USBD_EPINTEN_RXPKIEN_Msk);

    } //for

}

static void _nu_ep_partition(void)
{
    /* Configure USB controller */
    /* Enable USB BUS, CEP and EPA ~ EPH global interrupt */
    USBD_ENABLE_USB_INT(USBD_GINTEN_USBIE_Msk
                        | USBD_GINTEN_CEPIE_Msk
                        | USBD_GINTEN_EPAIE_Msk
                        | USBD_GINTEN_EPBIE_Msk
                        | USBD_GINTEN_EPCIE_Msk
                        | USBD_GINTEN_EPDIE_Msk
                        | USBD_GINTEN_EPEIE_Msk
                        | USBD_GINTEN_EPFIE_Msk
                        | USBD_GINTEN_EPGIE_Msk
                        | USBD_GINTEN_EPHIE_Msk
                        | USBD_GINTEN_EPIIE_Msk
                        | USBD_GINTEN_EPJIE_Msk
                        | USBD_GINTEN_EPKIE_Msk
                        | USBD_GINTEN_EPLIE_Msk);

    /* Enable BUS interrupt */
    USBD_ENABLE_BUS_INT(USBD_BUSINTEN_DMADONEIEN_Msk
                        | USBD_BUSINTEN_RESUMEIEN_Msk
                        | USBD_BUSINTEN_RSTIEN_Msk
                        | USBD_BUSINTEN_VBUSDETIEN_Msk);
    /* Reset Address to 0 */
    USBD_SET_ADDR(0);

    /*****************************************************/
    /* Control endpoint */
    USBD_SetEpBufAddr(CEP, CEP_BUF_BASE, CEP_BUF_LEN);
    USBD_ENABLE_CEP_INT(USBD_CEPINTEN_SETUPPKIEN_Msk
                        | USBD_CEPINTEN_STSDONEIEN_Msk);

    _nu_ep_partition_set(1);
}

static void NU_SetupStageCallback(nu_usbd_t *nu_udc)
{
    struct urequest setup_packet;

    /* Setup packet process */
    setup_packet.request_type   = (uint8_t)(nu_udc->base->SETUP1_0 & 0xfful);
    setup_packet.bRequest       = (uint8_t)((nu_udc->base->SETUP1_0 >> 8) & 0xfful);
    setup_packet.wValue         = (uint16_t)  nu_udc->base->SETUP3_2;
    setup_packet.wIndex         = (uint16_t)  nu_udc->base->SETUP5_4;
    setup_packet.wLength        = (uint16_t)  nu_udc->base->SETUP7_6;

    rt_usbd_ep0_setup_handler(&_rt_obj_udc, (struct urequest *)&setup_packet);
}

static rt_err_t _ep_set_stall(rt_uint8_t address)
{

    if (address  & USB_EPNO_MASK)
    {
        USBD_SetEpStall(EPADR_SW2HW(address));
    }
    else
    {
        /* Not support. Reply STALL. */
        USBD_SET_CEP_STATE(USBD_CEPCTL_STALLEN_Msk);
        USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_SETUPPKIF_Msk);
        USBD_ENABLE_CEP_INT(USBD_CEPINTEN_SETUPPKIEN_Msk);
    }
    return RT_EOK;
}

static rt_err_t _ep_clear_stall(rt_uint8_t address)
{
    if (address  & USB_EPNO_MASK)
    {
        USBD_ClearEpStall(EPADR_SW2HW(address));
    }

    return RT_EOK;
}


static rt_err_t _set_address(rt_uint8_t address)
{
    if (0 != address)
    {
        nu_usbd.address_tmp = address;
    }

    return RT_EOK;
}

static rt_err_t _set_config(rt_uint8_t address)
{
    return RT_EOK;
}

static rt_err_t _ep_enable(uep_t ep)
{
    RT_ASSERT(ep != RT_NULL);
    RT_ASSERT(ep->ep_desc != RT_NULL);

    USBD->EP[EPADR_SW2HW(ep->ep_desc->bEndpointAddress)].EPRSPCTL = USB_EP_RSPCTL_TOGGLE;
    USBD->EP[EPADR_SW2HW(ep->ep_desc->bEndpointAddress)].EPCFG |= USB_EP_CFG_VALID;

    return RT_EOK;
}

static rt_err_t _ep_disable(uep_t ep)
{
    RT_ASSERT(ep != RT_NULL);
    RT_ASSERT(ep->ep_desc != RT_NULL);
    USBD->EP[EPADR_SW2HW(ep->ep_desc->bEndpointAddress)].EPCFG &= ~USB_EP_CFG_VALID;

    return RT_EOK;
}

static rt_err_t _ep0_send_status(void)
{
    /* Status Stage */
    USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_STSDONEIF_Msk
                          | USBD_CEPINTSTS_SETUPPKIF_Msk);

    USBD_ENABLE_CEP_INT(USBD_CEPINTEN_STSDONEIEN_Msk);

    USBD_SET_CEP_STATE(USB_CEPCTL_NAKCLR);

    return RT_EOK;
}

__STATIC_INLINE void nu_buffer_cpy(rt_uint8_t address, void *buffer, rt_size_t size)
{
    rt_uint32_t i, cnt;
    rt_uint32_t *_buf_word;
    rt_uint8_t  *_buf_byte;

    _buf_word = (rt_uint32_t *)buffer;
    cnt = size >> 2;
    _buf_byte = (rt_uint8_t *)((rt_uint8_t *)buffer + (cnt * 4));

    if ((address & USB_EPNO_MASK)) //EPs
    {
        if (address &  USB_DIR_IN) //IN
        {
            /* Non-control endpoint IN*/
            for (i = 0; i < cnt; i++)
            {
                USBD->EP[EPADR_SW2HW(address)].ep.EPDAT = _buf_word[i];
            }

            for (i = 0ul; i < (size % 4ul); i++)
                USBD->EP[EPADR_SW2HW(address)].ep.EPDAT_BYTE = _buf_byte[i];
        }
        else //OUT
        {
            for (i = 0; i < cnt; i++)
            {
                _buf_word[i] = USBD->EP[EPADR_SW2HW(address)].ep.EPDAT;
            }

            for (i = 0ul; i < (size % 4ul); i++)
                _buf_byte[i] = USBD->EP[EPADR_SW2HW(address)].ep.EPDAT_BYTE;
        }
    }
    else //Control
    {
        if (address &  USB_DIR_IN) //IN
        {
            for (i = 0; i < cnt; i++)
            {
                USBD->cep.CEPDAT = _buf_word[i];
            }

            for (i = 0ul; i < (size % 4ul); i++)
                USBD->cep.CEPDAT_BYTE = _buf_byte[i];

        }
        else //OUT
        {
            for (i = 0; i < cnt; i++)
            {
                _buf_word[i] = USBD->cep.CEPDAT;
            }

            for (i = 0ul; i < (size % 4ul); i++)
                _buf_byte[i] = USBD->cep.CEPDAT_BYTE;
        }
    }
}

static rt_size_t _ep_read(rt_uint8_t address, void *buffer)
{
    rt_size_t size  = 0;

    RT_ASSERT(!(address & USB_DIR_IN));

    if ((address & USB_EPNO_MASK))
    {
        RT_ASSERT(buffer != RT_NULL);
        size = USBD->EP[EPADR_SW2HW(address)].EPDATCNT & 0xffff;
        nu_buffer_cpy(address, buffer, size);
    }
    else     //control transfer
    {

        size =  USBD->CEPRXCNT & 0xffff;
        if (size)
        {
            RT_ASSERT(_rt_obj_udc.stage == STAGE_DOUT);
            nu_buffer_cpy(address, buffer, size);
        }

        _ep0_send_status();
    }

    return size;
}

static rt_size_t _ep_read_prepare(rt_uint8_t address, void *buffer, rt_size_t size)
{
    RT_ASSERT(!(address & USB_DIR_IN));

    if ((address & USB_EPNO_MASK))
    {
        USBD_ENABLE_EP_INT(EPADR_SW2HW(address),
                           USBD_EPINTEN_RXPKIEN_Msk);
    }
    else //control transfer
    {
        if (size)
        {
            RT_ASSERT(_rt_obj_udc.stage == STAGE_DOUT);
            USBD_ENABLE_CEP_INT(USBD_CEPINTEN_OUTTKIEN_Msk);
        }
        else
        {

            RT_ASSERT(_rt_obj_udc.stage == STAGE_STATUS_OUT);
            USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_SETUPPKIF_Msk
                                  | USBD_CEPINTSTS_STSDONEIF_Msk);
            USBD_ENABLE_CEP_INT(USBD_CEPINTEN_SETUPPKIEN_Msk
                                | USBD_CEPINTEN_STSDONEIEN_Msk);
            USBD_SET_CEP_STATE(USB_CEPCTL_NAKCLR);
        }

