RT-Thread/rt-thread/bsp/nuvoton/libraries/nuc980/rtt_port/drv_usbd.c
    }

    return size;
}

static rt_size_t _ep_write(rt_uint8_t address, void *buffer, rt_size_t size)
{

    RT_ASSERT((address & USB_DIR_IN));

    if (!(address & USB_EPNO_MASK)) //control transfer
    {
        if (size)
        {
            nu_buffer_cpy(address, buffer, size);
            USBD_START_CEP_IN(size);
        }
        else//zero length
        {
            USBD_SET_CEP_STATE(USB_CEPCTL_ZEROLEN);
            USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_STSDONEIF_Msk
                                  | USBD_CEPINTSTS_SETUPPKIF_Msk);

            USBD_ENABLE_CEP_INT(USBD_CEPINTEN_SETUPPKIEN_Msk
                                | USBD_CEPINTEN_STSDONEIEN_Msk);
        }

        if (_rt_obj_udc.stage == STAGE_DIN)
        {
            USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_TXPKIF_Msk);
            USBD_ENABLE_CEP_INT(USBD_CEPINTEN_TXPKIEN_Msk);
        }
        else if (_rt_obj_udc.stage == STAGE_DOUT)
        {
            USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_RXPKIF_Msk);
            USBD_ENABLE_CEP_INT(USBD_CEPINTEN_RXPKIEN_Msk);
        }
    }
    else
    {
        /* Non-control endpoint IN*/
        nu_buffer_cpy(address, buffer, size);
        USBD->EP[EPADR_SW2HW(address)].EPRSPCTL = USB_EP_RSPCTL_SHORTTXEN; // packet end
        USBD->EP[EPADR_SW2HW(address)].EPTXCNT = size;

        if ((USBD->EP[EPADR_SW2HW(address)].EPCFG & USBD_EPCFG_EPTYPE_Msk) == USB_EP_CFG_TYPE_INT)
        {
            USBD_ENABLE_EP_INT(EPADR_SW2HW(address), USBD_EPINTEN_INTKIEN_Msk);  //for interrupt transfer timing
        }
        else
        {
            USBD_ENABLE_EP_INT(EPADR_SW2HW(address), USBD_EPINTEN_TXPKIEN_Msk);  //for bulk transfer  timing
        }
    }

    return size;
}

static rt_err_t _suspend(void)
{
    return RT_EOK;
}

static rt_err_t _wakeup(void)
{
    return RT_EOK;
}

static void nu_usbd_isr(int vector, void *param)
{
    __IO rt_uint32_t IrqStL, IrqSt;
    int i;
    int IrqStAllEP;

    IrqStL = USBD->GINTSTS & USBD->GINTEN;    /* get interrupt status */

    if (!IrqStL)    return;

    /* USB interrupt */
    if (IrqStL & USBD_GINTSTS_USBIF_Msk)
    {
        IrqSt = USBD->BUSINTSTS & USBD->BUSINTEN;

        if (IrqSt & USBD_BUSINTSTS_SOFIF_Msk)
        {
            USBD_CLR_BUS_INT_FLAG(USBD_BUSINTSTS_SOFIF_Msk);
            rt_usbd_sof_handler(&_rt_obj_udc);
        }
        if (IrqSt & USBD_BUSINTSTS_RSTIF_Msk)
        {
            /* Reset USB device address */
            USBD_SET_ADDR(0ul);

            USBD_ResetDMA();
            for (i = 0; i < USBD_MAX_EP; i++)
                USBD->EP[i].EPRSPCTL = USBD_EPRSPCTL_FLUSH_Msk;

            if (USBD->OPER & 0x04)    /* high speed */
            {
                LOG_I("-High Speed-");
                _nu_ep_partition_set(1);
            }
            else                        /* full speed */
            {
                LOG_I("-Full Speed-");
                _nu_ep_partition_set(0);
            }

            USBD_ENABLE_CEP_INT(USBD_CEPINTEN_SETUPPKIEN_Msk);
            USBD_ENABLE_BUS_INT(USBD_BUSINTEN_RSTIEN_Msk
                                | USBD_BUSINTEN_RESUMEIEN_Msk
                                | USBD_BUSINTEN_SUSPENDIEN_Msk
                                | USBD_BUSINTEN_VBUSDETIEN_Msk);
            USBD_CLR_BUS_INT_FLAG(USBD_BUSINTSTS_RSTIF_Msk);
            USBD_CLR_CEP_INT_FLAG(0x1ffc);

            for (i = 0ul; i < USBD_MAX_EP; i++)
            {
                if ((USBD->EP[i].EPCFG & 0x1ul) == 0x1ul)
                {
                    USBD->EP[i].EPRSPCTL = USB_EP_RSPCTL_TOGGLE;
                }
            }
            rt_usbd_reset_handler(&_rt_obj_udc);
            USBD_ENABLE_USB();
        }

        if (IrqSt & USBD_BUSINTSTS_RESUMEIF_Msk)
        {
            LOG_I("-Resume-");
            USBD_ENABLE_BUS_INT(USBD_BUSINTEN_RSTIEN_Msk | USBD_BUSINTEN_SUSPENDIEN_Msk);
            USBD_CLR_BUS_INT_FLAG(USBD_BUSINTSTS_RESUMEIF_Msk);
        }

        if (IrqSt & USBD_BUSINTSTS_SUSPENDIF_Msk)
        {
            LOG_I("-Suspend-");
            USBD_ENABLE_BUS_INT(USBD_BUSINTEN_RSTIEN_Msk | USBD_BUSINTEN_RESUMEIEN_Msk | USBD_BUSINTEN_VBUSDETIEN_Msk);
            USBD_CLR_BUS_INT_FLAG(USBD_BUSINTSTS_SUSPENDIF_Msk);
        }

        if (IrqSt & USBD_BUSINTSTS_HISPDIF_Msk)
        {
            USBD_ENABLE_CEP_INT(USBD_CEPINTEN_SETUPPKIEN_Msk);
            USBD_CLR_BUS_INT_FLAG(USBD_BUSINTSTS_HISPDIF_Msk);
        }

        if (IrqSt & USBD_BUSINTSTS_DMADONEIF_Msk)
        {
            USBD_CLR_BUS_INT_FLAG(USBD_BUSINTSTS_DMADONEIF_Msk);

            if (!(USBD->DMACTL & USBD_DMACTL_DMARD_Msk))
            {
                USBD_ENABLE_EP_INT(EPD, USBD_EPINTEN_RXPKIEN_Msk);
            }
        }

        if (IrqSt & USBD_BUSINTSTS_PHYCLKVLDIF_Msk)
        {
            USBD_CLR_BUS_INT_FLAG(USBD_BUSINTSTS_PHYCLKVLDIF_Msk);
        }

        if (IrqSt & USBD_BUSINTSTS_VBUSDETIF_Msk)
        {
            if (USBD_IS_ATTACHED())
            {
                LOG_I("PLUG IN");
                /* USB Plug In */
                USBD_ENABLE_USB();
                rt_usbd_connect_handler(&_rt_obj_udc);
            }
            else
            {
                LOG_I("Un-Plug");
                /* USB Un-plug */
                USBD_DISABLE_USB();
                rt_usbd_disconnect_handler(&_rt_obj_udc);
            }
            USBD_CLR_BUS_INT_FLAG(USBD_BUSINTSTS_VBUSDETIF_Msk);
        }
    } //if (IrqStL & USBD_GINTSTS_USBIF_Msk)

    /* Control Transfer */
    if (IrqStL & USBD_GINTSTS_CEPIF_Msk)
    {
        IrqSt = USBD->CEPINTSTS & USBD->CEPINTEN;

        if (IrqSt & USBD_CEPINTSTS_SETUPTKIF_Msk)
        {
            USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_SETUPTKIF_Msk);
            return;
        }

        if (IrqSt & USBD_CEPINTSTS_SETUPPKIF_Msk)
        {
            USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_SETUPPKIF_Msk);
            NU_SetupStageCallback(&nu_usbd);
            USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_INTKIF_Msk
                                  | USBD_CEPINTSTS_RXPKIF_Msk
                                  | USBD_CEPINTSTS_STSDONEIF_Msk);
            return;
        }

        if (IrqSt & USBD_CEPINTSTS_OUTTKIF_Msk)
        {
            USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_OUTTKIF_Msk);
            rt_usbd_ep0_out_handler(&_rt_obj_udc, 0);
            USBD_ENABLE_CEP_INT(USBD_CEPINTEN_RXPKIEN_Msk);
            return;
        }

        if (IrqSt & USBD_CEPINTSTS_INTKIF_Msk)
        {
            USBD_ENABLE_CEP_INT(0);
            USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_INTKIF_Msk);
            rt_usbd_ep0_in_handler(&_rt_obj_udc);
            return;
        }

        if (IrqSt & USBD_CEPINTSTS_PINGIF_Msk)
        {
            USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_PINGIF_Msk);
            return;
        }

        if (IrqSt & USBD_CEPINTSTS_TXPKIF_Msk)
        {
            USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_TXPKIF_Msk
                                  | USBD_CEPINTSTS_SETUPPKIF_Msk
                                  | USBD_CEPINTSTS_STSDONEIF_Msk);

            USBD_ENABLE_CEP_INT(USBD_CEPINTEN_INTKIEN_Msk
                                | USBD_CEPINTEN_SETUPPKIEN_Msk
                                | USBD_CEPINTEN_STSDONEIEN_Msk);

            USBD_SET_CEP_STATE(USB_CEPCTL_NAKCLR);
            return;
        }

        if (IrqSt & USBD_CEPINTSTS_RXPKIF_Msk)
        {

            USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_SETUPPKIF_Msk
                                  | USBD_CEPINTSTS_STSDONEIF_Msk
                                  | USBD_CEPINTSTS_RXPKIF_Msk);
            USBD_SET_CEP_STATE(USB_CEPCTL_NAKCLR);
            USBD_ENABLE_CEP_INT(USBD_CEPINTEN_SETUPPKIEN_Msk
                                | USBD_CEPINTEN_STSDONEIEN_Msk
                                | USBD_CEPINTEN_RXPKIEN_Msk);
            return;
        }

