RT-Thread/rt-thread/bsp/nuvoton/libraries/nuc980/rtt_port/drv_usbd.c
        if (IrqSt & USBD_CEPINTSTS_NAKIF_Msk)
        {
            USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_NAKIF_Msk);
            return;
        }

        if (IrqSt & USBD_CEPINTSTS_STALLIF_Msk)
        {
            USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_STALLIF_Msk);
            return;
        }

        if (IrqSt & USBD_CEPINTSTS_ERRIF_Msk)
        {
            USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_ERRIF_Msk);
            return;
        }

        if (IrqSt & USBD_CEPINTSTS_STSDONEIF_Msk)
        {

            USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_STSDONEIF_Msk | USBD_CEPINTSTS_SETUPPKIF_Msk);
            USBD_ENABLE_CEP_INT(USBD_CEPINTEN_SETUPPKIEN_Msk);

            if ((USBD_GET_ADDR() == 0)
                    && ((uint8_t)((nu_usbd.base->SETUP1_0 >> 8) & 0xfful) == SET_ADDRESS))
            {
                USBD_SET_ADDR(nu_usbd.address_tmp);
                LOG_I("SET ADDR: 0x%02x", nu_usbd.address_tmp);
                nu_usbd.address_tmp = 0;

            }
            return;
        }

        if (IrqSt & USBD_CEPINTSTS_BUFFULLIF_Msk)
        {
            USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_BUFFULLIF_Msk);
            return;
        }

        if (IrqSt & USBD_CEPINTSTS_BUFEMPTYIF_Msk)
        {
            USBD_CLR_CEP_INT_FLAG(USBD_CEPINTSTS_BUFEMPTYIF_Msk);
            return;
        }

    } //if (IrqStL & USBD_GINTSTS_CEPIF_Msk)

    // For End-points
    IrqStAllEP = (IrqStL >> USBD_GINTSTS_EPAIF_Pos) & ((1 << USBD_MAX_EP) - 1);

    // Find the position of first '1' in allch_sts.
    while ((i = nu_ctz(IrqStAllEP)) != 32)
    {
        IrqSt = USBD->EP[i].EPINTSTS & USBD->EP[i].EPINTEN;

        if (_ep_pool[i + 1].dir == USB_DIR_IN)
            USBD_ENABLE_EP_INT(i, 0);

        USBD_CLR_EP_INT_FLAG(i, IrqSt);

        rt_usbd_ep_in_handler(&_rt_obj_udc, _ep_pool[i + 1].dir | EPADR_HW2SW(i), 0);

        IrqStAllEP &= ~(1 << i);
    }
}

static rt_err_t _init(rt_device_t device)
{
#if !defined(BSP_USING_OTG)
    uint32_t volatile i;

    /* Initialize USB PHY */
    SYS_UnlockReg();
    SYS->USBPHY &= ~SYS_USBPHY_HSUSBROLE_Msk;    /* select USBD */

    /* Enable USB PHY */
    SYS->USBPHY = (SYS->USBPHY & ~(SYS_USBPHY_HSUSBROLE_Msk | SYS_USBPHY_HSUSBACT_Msk)) | SYS_USBPHY_HSUSBEN_Msk;

    for (i = 0; i < 0x1000; i++)
        __NOP();  // delay > 10 us

    SYS->USBPHY |= SYS_USBPHY_HSUSBACT_Msk;
    SYS_LockReg();
#endif

    nu_sys_ipclk_enable(nu_usbd.clkidx);

    nu_sys_ip_reset(nu_usbd.rstidx);

    /* USBD Open */
    USBD->PHYCTL |= (USBD_PHYCTL_PHYEN_Msk | USBD_PHYCTL_DPPUEN_Msk);
    while (1)
    {
        USBD->EP[EPA].EPMPS = 0x20ul;
        if (USBD->EP[EPA].EPMPS == 0x20ul)
        {
            break;
        }
    }

    /* Force SE0 */
    USBD_SET_SE0();

    _nu_ep_partition();

#if ENABLE_FULL_SPEED_MODE_ONLY
    USBD->OPER &= ~USBD_OPER_HISPDEN_Msk;
#else
    USBD->OPER |= USBD_OPER_HISPDEN_Msk;
#endif

    /* Install USBD interrupt */
    rt_hw_interrupt_install(nu_usbd.irqn, nu_usbd_isr, &nu_usbd, nu_usbd.name);
    rt_hw_interrupt_set_priority(nu_usbd.irqn, IRQ_LEVEL_1);

    /* Enable USBD interrupt */
    rt_hw_interrupt_umask(nu_usbd.irqn);

    /* Start transaction */
    USBD_Start();
    return RT_EOK;
}

const static struct udcd_ops _udc_ops =
{
    _set_address,
    _set_config,
    _ep_set_stall,
    _ep_clear_stall,
    _ep_enable,
    _ep_disable,
    _ep_read_prepare,
    _ep_read,
    _ep_write,
    _ep0_send_status,
    _suspend,
    _wakeup,
};

#ifdef RT_USING_DEVICE_OPS
const static struct rt_device_ops _ops =
{
    _init,
    RT_NULL,
    RT_NULL,
    RT_NULL,
    RT_NULL,
    RT_NULL,
};
#endif

int nu_usbd_register(void)
{
    rt_err_t result = RT_EOK;

    rt_memset((void *)&_rt_obj_udc, 0, sizeof(struct udcd));
    _rt_obj_udc.parent.type = RT_Device_Class_USBDevice;

#ifdef RT_USING_DEVICE_OPS
    _rt_obj_udc.parent.ops = &_ops;
#else
    _rt_obj_udc.parent.init = _init;
#endif

    _rt_obj_udc.parent.user_data = &nu_usbd;
    _rt_obj_udc.ops = &_udc_ops;

    /* Register endpoint information */
    _rt_obj_udc.ep_pool = _ep_pool;
    _rt_obj_udc.ep0.id = &_ep_pool[0];

#if ENABLE_FULL_SPEED_MODE_ONLY
    _rt_obj_udc.device_is_hs = RT_FALSE; /* Enable Full-speed only */
#else
    _rt_obj_udc.device_is_hs = RT_TRUE; /* Support Hi-Speed */
#endif

    result = rt_device_register((rt_device_t)&_rt_obj_udc, nu_usbd.name, 0);
    RT_ASSERT(result == RT_EOK);

    return rt_usb_device_init();
}
INIT_DEVICE_EXPORT(nu_usbd_register);
#endif
